
/************************************************************************
* Copyright (c) 2009,芯通科技有限公司
* All rights reserved.
* 文件名称：
* 文件标识：reserved
* 摘要：获取DLL文件中的函数名
*
************************************************************************/

/************************************************************************
* 版本：2.0.1.0
* 作者：dolby.jiang
* 完成日期：2009年8月26日
* 更改：文件建立
*
************************************************************************/

/************************************************************************
* 版本：2.0.1.0
* 作者：dolby.jiang
* 完成日期：2009年9月30日
* 更改：增加GetSubStr方法
*
************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif
	
	//获取DLL的函数名称
	void _stdcall AnalysisFunction(const char *szDllName, char **FunctionList, int *Count);
	
	//分离_stdcall定义的API函数方法名和函数参数个数
	void _stdcall GetSubStr(const char *SourceStr, char *Substr, int *Count);

#ifdef __cplusplus
}
#endif